{
  "title": "The Sands Of Time Are Sinking, The Dawn Of Heaven Breaks",
  "songNumber": 105,
  "pages": "120, 121",
  "author": "",
  "music": "",
  "presentation": "v1 v2 v3 v4 v5 v6 v7 v8 v9",
  "key": "",
  "guitar": "",
  "time": "",
  "meter": "",
  "scripture": "",
  "theme": "",
  "theme2": "",
  "urlLink": "",
  "notes": "",
  "ccli": "",
  "dateComposed": "",
  "misc": "",
  "lyrics": {
    "v1": [
      "The sands of time are sinking, the dawn of heaven breaks,",
      "The summer morn I've sighed for, the fair sweet morn awakes:",
      "Dark, dark hath been the midnight, but dayspring is at hand,",
      "And glory, glory dwelleth in Immanuel's land."
    ],
    "v2": [
      "O Christ, He is the fountain, the deep sweet well of love!",
      "The streams of earth I've tasted, more deep I'll drink above:",
      "There to an ocean fulness, His mercy doth expand;",
      "And glory, glory dwelleth in Immanuel's land."
    ],
    "v3": [
      "I've wrestled on t'wards heaven, 'gainst storm, and wind, and tide;",
      "Now, like a weary traveler, that leaneth on his guide,",
      "Amid the shades of evening, While sinks life's lingering sand,",
      "I hail the glory dawning in Immanuel's land."
    ],
    "v4": [
      "With mercy and with judgment my web of time He wove,",
      "And aye the dews of sorrow were lustered by His love;",
      "I'll bless the hand that guided, I'll bless the heart that planned,",
      "When throned where glory dwelleth, in Immanuel's land."
    ],
    "v5": [
      "O I am my Beloved's and my Beloved's mine!",
      "He brings a poor vile sinner into His \"house of wine.\"",
      "I stand upon His merit—I know no other stand,",
      "Not e'en where glory dwelleth in Immanuel's land."
    ],
    "v6": [
      "The Bride eyes not her garment, but her dear Bridegroom's face;",
      "I will not gaze at glory but on my King of grace.",
      "Not at the crown He giveth but on His pierced hand;",
      "The Lamb is all the glory of Immanuel's land."
    ],
    "v7": [
      "I have borne scorn and hatred, I have borne wrong and shame,",
      "Earth's proud ones have reproached me for Christ's thrice blessed Name:",
      "Where God His seal set fairest they've stamped the foulest brand,",
      "But judgment shines like noonday in Immanuel's land."
    ],
    "v8": [
      "Soon shall the cup of glory wash down earth's bitterest woes,",
      "Soon shall the desert briar break into Eden's rose;",
      "The curse shall change to blessing the name on earth that's banned",
      "Be graven on the white stone in Immanuel's land."
    ],
    "v9": [
      "I shall sleep sound in Jesus, filled with His likeness rise,",
      "To love and to adore Him, to see Him with these eyes:",
      "'Tween me and resurrection but Paradise doth stand;",
      "Then—then for glory dwelling in Immanuel's land."
    ]
  }
}