{
  "title": "On The Lord's Side",
  "songNumber": 276,
  "pages": "316, 317",
  "author": "",
  "music": "",
  "presentation": "v1 v2 v3 v4 v5",
  "key": "",
  "guitar": "",
  "time": "",
  "meter": "",
  "scripture": "",
  "theme": "",
  "theme2": "",
  "urlLink": "",
  "notes": "",
  "ccli": "",
  "dateComposed": "",
  "misc": "",
  "lyrics": {
    "v1": [
      "Who is on the Lord's side? Who will serve the King?",
      "Who will be His helpers, other lives to bring?",
      "Who will leave the world's side? Who will face the foe?",
      "Who is on the Lord's side? Who for Him will go?",
      "By Thy call of mercy, by Thy grace divine,",
      "We are on the Lord's side— Savior, we are Thine."
    ],
    "v2": [
      "Not for weight of glory, not for crown and palm,",
      "Enter we the army, raise the warrior psalm;",
      "But for love that claimeth lives for whom He died;",
      "He whom Jesus nameth must be on His side.",
      "By Thy love constraining, by Thy grace divine,",
      "We are on the Lord's side— Savior, we are Thine."
    ],
    "v3": [
      "Jesus, Thou hast bought us, not with gold or gem,",
      "But with Thine own lifeblood, for Thy diadem;",
      "With Thy blessing filling each who comes to Thee,",
      "Thou hast made us willing, Thou hast made us free.",
      "By Thy grand redemption, by Thy grace divine,",
      "We are on the Lord's side— Savior, we are Thine."
    ],
    "v4": [
      "Fierce may be the conflict, strong may be the foe,",
      "But the King's own army none can overthrow.",
      "Round His standard ranging vict'ry is secure,",
      "For His truth unchanging makes the triumph sure.",
      "Joyfully enlisting, by Thy grace divine,",
      "We are on the Lord's side— Savior, we are Thine."
    ],
    "v5": [
      "Chosen to be soldiers in an alien land:",
      "Chosen, called, and faithful, for our Captain's band;",
      "In the service royal let us not grow cold;",
      "Let us be right loyal, noble, true, and bold.",
      "Master Thou wilt keep us, by Thy grace divine,",
      "Always on the Lord's side—Savior, we are Thine."
    ]
  }
}