{
  "title": "I Am Your Life",
  "songNumber": 277,
  "pages": "318, 319",
  "author": "",
  "music": "",
  "presentation": "v1 v2 v3 v4 v5 v6 v7 v8 v9 v10 v11",
  "key": "",
  "guitar": "",
  "time": "",
  "meter": "",
  "scripture": "",
  "theme": "",
  "theme2": "",
  "urlLink": "",
  "notes": "",
  "ccli": "",
  "dateComposed": "",
  "misc": "",
  "lyrics": {
    "v1": [
      "I don't know how to follow You my Lord.",
      "How can I run this racecourse to the end?",
      "The darkness swells and covers me around;",
      "My precious faith no longer clear to me."
    ],
    "v2": [
      "I hear Your voice, it calls me to Yourself;",
      "I see Your hand, it draws me to Your rest;",
      "Yet mountains high keep me from drawing nigh;",
      "How can I run the journey to the end."
    ],
    "v3": [
      "My sorrow, can it really touch Your heart?",
      "Does my soft prayer move You to tenderness?",
      "Do drops of tears drop to Your inmost part?",
      "Such helplessness, it occupies my heart."
    ],
    "v4": [
      "Where did the promised consecration fail?",
      "What made the sweetness in my mind depart?",
      "Such joy and hope— just precious memories,",
      "O Lord, You are within this saddened heart."
    ],
    "v5": [
      "O Lord, have You forsaken me fore'er,",
      "Or am I disappointed in Your lead?",
      "Surely such sorrow only feels deep pain;",
      "Can I trust You as You know what I am?"
    ],
    "v6": [
      "So full of tears trickling before Your face;",
      "My feeble songs, I see no smiling face.",
      "Your harshest blows, they break me to the core;",
      "Yet nail-scarred hands are hands of love the more."
    ],
    "v7": [
      "Can You revive my spirit, Lord, again?",
      "Can You rekindle love so deep within?",
      "This was Your promise and Your calling true,",
      "Your inspiration and Your word of love."
    ],
    "v8": [
      "I cannot trust, yet still I trust in You;",
      "I cannot cling, yet clinging closely still;",
      "You never failed me, not one day or year,",
      "Your faithfulness is shown in my pursuit."
    ],
    "v9": [
      "No faith, no word or feeling in my heart;",
      "All darkness, hardness, and reducing too;",
      "This is the pathway You ordained for me,",
      "That in my life, I only You possess."
    ],
    "v10": [
      "And now I know, You're my experience;",
      "What all seemed loss, was so to gain You more",
      "Everything gone, now I am one with You;",
      "Where there's no way, I see You testified."
    ],
    "v11": [
      "I sigh in love—I see Your hand of love;",
      "I sweetly muse—You've stripped me throughout life;",
      "You lead me into seeming hopelessness,",
      "Then whispering to me: \"I am your life.\""
    ]
  }
}