{
  "title": "How Firm A Foundation",
  "songNumber": 283,
  "pages": "327",
  "author": "",
  "music": "",
  "presentation": "v1 v2 v3 v4 v5 v6 v7",
  "key": "",
  "guitar": "",
  "time": "",
  "meter": "",
  "scripture": "",
  "theme": "",
  "theme2": "",
  "urlLink": "",
  "notes": "",
  "ccli": "",
  "dateComposed": "",
  "misc": "Sun, Oct 6, 2019",
  "lyrics": {
    "v1": [
      "How firm a foundation, ye saints of the Lord,",
      "Is laid for your faith in His excellent Word!",
      "What more can He say than to you He hath said,",
      "To you who for refuge to Jesus have fled?"
    ],
    "v2": [
      "In every condition, in sickness, in health;",
      "In poverty's vale, or abounding in wealth;",
      "At home and abroad, on the land, on the sea,",
      "As thy days may demand, shall thy strength ever be."
    ],
    "v3": [
      "\"Fear not, I am with thee, O be not dismayed,",
      "For I am thy God, and will still give thee aid;",
      "I'll strengthen thee, help thee, and cause thee to stand,",
      "Upheld by My righteous, omnipotent hand.\""
    ],
    "v4": [
      "\"When through the deep waters I call thee to go,",
      "The rivers of sorrow shall not overflow;",
      "For I will be with thee, thy troubles to bless,",
      "And sanctify to thee thy deepest distress.\""
    ],
    "v5": [
      "\"When through fiery trials thy pathway shall lie,",
      "My grace, all sufficient, shall be thy supply;",
      "The flame shall not hurt thee; I only design",
      "Thy dross to consume, and thy gold to refine.\""
    ],
    "v6": [
      "\"E'en down to old age all My people shall prove",
      "My sovereign, eternal, unchangeable love;",
      "And then, when grey hairs shall their temples adorn,",
      "Like lambs they shall still in My bosom be borne.\""
    ],
    "v7": [
      "\"The soul that on Jesus hath leaned for repose,",
      "I will not, I will not desert to his foes;",
      "That soul, though all hell should endeavor to shake,",
      "I'll never, no, never, no, never forsake!\""
    ]
  }
}