{
  "title": "I Cannot Tell",
  "songNumber": 436,
  "pages": "522, 523",
  "author": "",
  "music": "",
  "presentation": "v1 v2 v3 v4",
  "key": "",
  "guitar": "",
  "time": "",
  "meter": "",
  "scripture": "",
  "theme": "",
  "theme2": "",
  "urlLink": "",
  "notes": "",
  "ccli": "",
  "dateComposed": "",
  "misc": "",
  "lyrics": {
    "v1": [
      "I cannot tell why He, whom angels worship,",
      "Should set His love upon the sons of men,",
      "Or why, as Shepherd, He should seek the wanderers,",
      "To bring them back, they know not how or when.",
      "But this I know, that He was born of Mary,",
      "When Bethl'hem's manger was His only home,",
      "And that He lived at Nazareth and labored,",
      "And so the Savior, Savior of the world, is come."
    ],
    "v2": [
      "I cannot tell how silently He suffered,",
      "As with His peace He graced this place of tears,",
      "Or how His heart upon the cross was broken,",
      "The crown of pain to three and thirty years.",
      "But this I know, He heals the brokenhearted,",
      "And stays our sin, and calms our lurking fear,",
      "And lifts the burden from the heavy laden,",
      "For yet the Savior, Savior of the world is here."
    ],
    "v3": [
      "I cannot tell how He will win the nations,",
      "How He will claim His earthly heritage,",
      "How satisfy the needs and aspirations",
      "Of east and west, of sinner and of sage.",
      "But this I know, all flesh shall see His glory,",
      "And He shall reap the harvest He has sown,",
      "And some glad day His sun shall shine in splendor",
      "When He the Savior, Savior of the world is known."
    ],
    "v4": [
      "I cannot tell how all the lands shall worship,",
      "When, at His bidding, every storm is stilled,",
      "Or who can say how great the jubilation",
      "When all the hearts of men with love are filled.",
      "But this I know, the skies will thrill with rapture,",
      "And myriad, myriad human voices sing,",
      "And earth to heav'n, and heav'n to earth, will answer:",
      "At last the Savior, Savior of the world, is King."
    ]
  }
}