{
  "title": "It Passeth Knowledge",
  "songNumber": 47,
  "pages": "52",
  "author": "Mary Shekleton (1827-1883)",
  "music": "Ira David Sankey (1840-1908)",
  "presentation": "v1 v2 v3 v4 v5",
  "key": "Bb Major",
  "guitar": "",
  "time": "4/4",
  "meter": "10.10.10.10.4.",
  "scripture": "",
  "theme": "Praise of the Lord",
  "theme2": "",
  "urlLink": "",
  "notes": "",
  "ccli": "5117665453",
  "dateComposed": "",
  "misc": "Thu, Jan 26, 2017",
  "lyrics": {
    "v1": [
      "It passeth knowledge, that dear love of Thine,",
      "My Savior, Jesus; yet this soul of mine",
      "Would of Thy love in all its breadth and length,",
      "Its height and depth, its everlasting strength,",
      "Know more and more."
    ],
    "v2": [
      "It passeth telling, that dear love of Thine,",
      "My Savior, Jesus; yet these lips of mine",
      "Would fain proclaim to sinners, far and near,",
      "A love which can remove all guilty fear,",
      "And love beget."
    ],
    "v3": [
      "It passeth praises, that dear love of Thine,",
      "My Savior, Jesus; yet this heart of mine",
      "Would sing that love, so full, so rich, so free,",
      "Which brings a rebel sinner, such as me,",
      "Nigh unto God."
    ],
    "v4": [
      "But though I cannot sing, or tell, or know",
      "The fulness of Thy love, while here below,",
      "My empty vessel I may freely bring;",
      "O Thou, who art of love the living spring,",
      "My vessel fill."
    ],
    "v5": [
      "I am an empty vessel—not one thought",
      "Or look of love to Thee I've ever brought;",
      "Yet I may come, and come again to Thee,",
      "With this the empty sinner's only plea,",
      "Thou lovest me."
    ],
    "v6": [
      "Oh, fill me, Jesus, Savior, with Thy love!",
      "Lead, lead me to the living fount above;",
      "Thither may I, in simple faith draw nigh,",
      "And never to another fountain fly,",
      "But unto Thee."
    ],
    "v7": [
      "Lord Jesus, when Thee face to face I see,",
      "When on Thy lofty throne I sit with Thee,",
      "Then of Thy love, in all its breadth and length,",
      "Its height and depth, its everlasting strength,",
      "My soul shall sing."
    ]
  }
}